js216/stm32mp135_test_board/baremetal/qspi/src/cli.c
// SPDX-License-Identifier: BSD-3-Clause

/**
 * @file cli.c
 * @brief Single-char command shell exercising the QSPI driver from a
 *        UART4 console.  Polled RX (no IRQ).  Every command is a single
 *        printable letter followed by space-separated decimal/hex args.
 * @author Jakob Kastelic
 * @copyright 2026 Stanford Research Systems, Inc.
 */

#include "cli.h"
#include "board.h"
#include "defaults.h"
#include "printf.h"
#include "qspi.h"
#include "stm32mp135fxx_ca7.h"
#include "stm32mp13xx_hal.h"
#include "stm32mp13xx_hal_gpio.h"
#include "stm32mp13xx_hal_rcc.h"
#include "stm32mp13xx_hal_rcc_ex.h"
#include <stdbool.h>
#include <stdint.h>
#include <stdlib.h>
#include <string.h>

extern HAL_StatusTypeDef qspi_set_dlyb(uint32_t sel, uint32_t unit);

#define LINEMAX  80
#define MAX_ARGS 8
#define READ_CAP 1024U
#define WRITE_CAP 256U
#define RXBUF    256
#define STREAM_CHUNK_BYTES (16U * 1024U * 1024U)
#define STREAM_MAX_XFER_BYTES STREAM_CHUNK_BYTES
#define STREAM_XOR_BYTES 131072U
#define CRC32_INIT   0xFFFFFFFFUL
#define CRC32_XOROUT 0xFFFFFFFFUL
#define CRC32_POLY   0xEDB88320UL
#define CRC32_HW_POLY 0x04C11DB7UL
#define CRC_MDMA_TIMEOUT_MS 60000U

static char linebuf[LINEMAX + 1];
static int  linelen;
static bool busy_flag;
static bool idle_jedec = true;
static bool auto_consume = true;
static bool four_byte_mode;
static uint32_t pend_confirm_C_until;
static uint8_t  io_buf[READ_CAP];
static uint32_t crc32_table[256];
static bool crc32_table_ready;
static uint8_t  crc32_pattern[256];
static uint32_t crc32_pattern_prefix[257];
static bool crc32_pattern_ready;
static uint32_t pattern_word_table[64];
static bool pattern_word_table_ready;
static bool crc32_hw_ready;
static bool crc32_hw_checked;
static bool crc32_hw_available;
static bool crc32_hw_direct_checked;
static bool crc32_hw_direct_available;
static bool crc32_mdma_active;

/* Software RX ring drained both from cli_poll and from inside the TX
 * char-write hook -- TX'ing a long printf burst takes longer than the
 * 1-byte hardware RX FIFO can hold, so we must drain on every char. */
static volatile uint8_t  rx_ring[RXBUF];
static volatile uint16_t rx_head;
static volatile uint16_t rx_tail;

bool cli_busy(void) { return busy_flag; }
bool cli_idle_jedec_enabled(void) { return idle_jedec; }

static void rx_drain_hw(void)
{
   while (UART4->ISR & USART_ISR_RXNE_RXFNE) {
      uint8_t c = (uint8_t)(UART4->RDR & 0xFFU);
      uint16_t nh = (uint16_t)((rx_head + 1U) % RXBUF);
      if (nh != rx_tail) {
         rx_ring[rx_head] = c;
         rx_head          = nh;
      }
      /* else drop on overflow */
   }
}

static int uart_rx_byte(int *out)
{
   rx_drain_hw();
   if (rx_head == rx_tail)
      return 0;
   *out    = rx_ring[rx_tail];
   rx_tail = (uint16_t)((rx_tail + 1U) % RXBUF);
   return 1;
}

static void uart_tx_byte(char c)
{
   while (!(UART4->ISR & USART_ISR_TXE))
      rx_drain_hw();
   UART4->TDR = (uint8_t)c;
}

static void prompt(void)
{
   my_printf("> ");
}

static int parse_args(char *p, char **argv, int max)
{
   int n = 0;
   while (*p && n < max) {
      while (*p == ' ' || *p == '\t')
         p++;
      if (!*p)
         break;
      argv[n++] = p;
      while (*p && *p != ' ' && *p != '\t')
         p++;
      if (*p) {
         *p++ = '\0';
      }
   }
   return n;
}

static uint32_t arg_u32(const char *s, uint32_t dflt)
{
   if (!s || !*s)
      return dflt;
   char *e = NULL;
   uint32_t v = (uint32_t)strtoul(s, &e, 0);
   if (e == s)
      return dflt;
   return v;
}

static uint32_t qspi_kernel_hz(void)
{
   return HAL_RCCEx_GetPeriphCLKFreq(RCC_PERIPHCLK_QSPI);
}

static uint32_t qspi_payload_ceiling_mbps_x10(uint32_t lanes)
{
   const uint64_t numerator = (uint64_t)qspi_kernel_hz() * lanes;
   const uint64_t denominator =
       ((uint64_t)qspi_get_prescaler() + 1ULL) * 100000ULL;

   if (denominator == 0ULL)
      return 0U;
   return (uint32_t)(numerator / denominator);
}

static uint32_t stream_mbps_x10(uint32_t len, uint32_t elapsed_ms,
                                uint32_t lanes)
{
   uint32_t dt = elapsed_ms;
   if (dt == 0U)
      dt = 1U;

   uint32_t mbps_x10;
   if (len <= 50000000U)
      mbps_x10 = (len * 80U) / (dt * 1000U);
   else
      mbps_x10 = ((len / 1000U) * 80U) / dt;

   const uint32_t ceiling_mbps_x10 =
      qspi_payload_ceiling_mbps_x10(lanes);
   if (mbps_x10 > ceiling_mbps_x10)
      mbps_x10 = ceiling_mbps_x10;
   return mbps_x10;
}

static void stream_print_xfer(uint32_t len, bool quad, uint32_t xfer_ms)
{
   const uint32_t mbps_x10 =
      stream_mbps_x10(len, xfer_ms, quad ? 4U : 1U);

   my_printf("stream_xfer %lu B %s in %lu ms, %lu.%lu Mbps\r\n",
             (unsigned long)len,
             quad ? "quad" : "1lane",
             (unsigned long)xfer_ms,
             (unsigned long)(mbps_x10 / 10U),
             (unsigned long)(mbps_x10 % 10U));
}

static void hexdump(uint32_t base, const uint8_t *data, uint32_t n)
{
   for (uint32_t i = 0; i < n; i += 16U) {
      my_printf("%08lx:", (unsigned long)(base + i));
      uint32_t row = (n - i) < 16U ? (n - i) : 16U;
      for (uint32_t j = 0; j < row; j++)
         my_printf(" %02x", data[i + j]);
      my_printf("\r\n");
   }
}

static void crc32_table_init(void)
{
   if (crc32_table_ready)
      return;
   for (uint32_t i = 0; i < 256U; i++) {
      uint32_t c = i;
      for (int j = 0; j < 8; j++)
         c = (c >> 1) ^ (CRC32_POLY & (-(int32_t)(c & 1U)));
      crc32_table[i] = c;
   }
   crc32_table_ready = true;
}

static inline uint32_t crc32_update_byte(uint32_t crc, uint8_t b)
{
   return (crc >> 8) ^ crc32_table[(crc ^ (uint32_t)b) & 0xFFU];
}

static uint32_t crc32_update_buf(uint32_t crc, const volatile uint8_t *p,
                                 uint32_t n, uint32_t base,
                                 uint32_t *first_err)
{
   crc32_table_init();
   for (uint32_t i = 0; i < n; i++) {
      const uint8_t b = p[i];
      crc = crc32_update_byte(crc, b);
      if (first_err != NULL) {
         const uint8_t exp = (uint8_t)((base + i) & 0xFFU);
         if (b != exp && *first_err == 0xFFFFFFFFUL)
            *first_err = base + i;
      }
   }
   return crc;
}

static void crc32_hw_enable(void)
{
   if (crc32_hw_ready)
      return;

   __HAL_RCC_CRC1_CLK_ENABLE();
   __HAL_RCC_CRC1_FORCE_RESET();
   __asm volatile("dsb sy" ::: "memory");
   __HAL_RCC_CRC1_RELEASE_RESET();
   __asm volatile("dsb sy" ::: "memory");
   crc32_hw_ready = true;
}

static void crc32_hw_reset(void)
{
   CRC1->POL  = CRC32_HW_POLY;
   CRC1->INIT = CRC32_INIT;
   CRC1->CR   = CRC_CR_REV_IN_0 | CRC_CR_REV_OUT | CRC_CR_RESET;
}

static void crc32_mdma_clear_flags(MDMA_Channel_TypeDef *ch)
{
   ch->CIFCR = MDMA_CIFCR_CTEIF | MDMA_CIFCR_CCTCIF |
               MDMA_CIFCR_CBRTIF | MDMA_CIFCR_CBTIF |
               MDMA_CIFCR_CLTCIF;
}

