js216/stm32mp135_test_board/baremetal/qspi/src/cli.c
static uint32_t mdma_segment_len(uint32_t remaining, uint32_t limit)
{
   uint32_t n = remaining;
   if (n > limit)
      n = limit;
   if (n > 0x10000U && (n & 0xFFFFU))
      n = 0x10000U;
   return n;
}

static uint32_t stream_segment_len(uint32_t remaining, uint32_t limit)
{
   uint32_t n = remaining;
   if (n > limit)
      n = limit;
   if (n > STREAM_MAX_XFER_BYTES)
      n = STREAM_MAX_XFER_BYTES;
   if (remaining <= 0x20000U) {
      if (remaining > 0x10000U && (remaining & 0xFFFFU))
         return 0x10000U;
      return n;
   }
   if (n & 0xFFFFU)
      n &= ~0xFFFFU;
   return n;
}

static uint32_t pattern_word(uint32_t off)
{
   const uint32_t b0 = (off + 0U) & 0xFFU;
   const uint32_t b1 = (off + 1U) & 0xFFU;
   const uint32_t b2 = (off + 2U) & 0xFFU;
   const uint32_t b3 = (off + 3U) & 0xFFU;
   return b0 | (b1 << 8) | (b2 << 16) | (b3 << 24);
}

static void pattern_word_table_init(void)
{
   if (pattern_word_table_ready)
      return;
   for (uint32_t i = 0U; i < 64U; i++)
      pattern_word_table[i] = pattern_word(i * 4U);
   pattern_word_table_ready = true;
}

static void validate_pattern_buf(const volatile uint8_t *p, uint32_t n,
                                 uint32_t base, uint32_t *first_err)
{
   pattern_word_table_init();
   const volatile uint32_t *w = (const volatile uint32_t *)p;
   uint32_t i = 0U;
   uint32_t pat = (base >> 2) & 63U;
   while (i + 4U <= n) {
      const uint32_t got = *w++;
      if (got != pattern_word_table[pat]) {
         for (uint32_t j = 0U; j < 4U; j++) {
            const uint8_t b = p[i + j];
            const uint8_t exp = (uint8_t)((base + i + j) & 0xFFU);
            if (b != exp) {
               *first_err = base + i + j;
               return;
            }
         }
      }
      i += 4U;
      pat = (pat + 1U) & 63U;
   }
   while (i < n) {
      const uint8_t b = p[i];
      const uint8_t exp = (uint8_t)((base + i) & 0xFFU);
      if (b != exp) {
         *first_err = base + i;
         return;
      }
      i++;
   }
}

static void stream_find_first_error(const uint32_t *slot_base,
                                    const uint32_t *slot_len,
                                    const bool *slot_valid,
                                    uint32_t *first_err)
{
   int first = 0;
   int second = 1;
   if (slot_valid[1] &&
       (!slot_valid[0] || slot_base[1] < slot_base[0])) {
      first = 1;
      second = 0;
   }

   if (slot_valid[first]) {
      validate_pattern_buf(
         (volatile uint8_t *)(DEF_DDR_BASE +
                              ((uint32_t)first * STREAM_CHUNK_BYTES)),
         slot_len[first], slot_base[first], first_err);
      if (*first_err != 0xFFFFFFFEU)
         return;
   }
   if (slot_valid[second]) {
      validate_pattern_buf(
         (volatile uint8_t *)(DEF_DDR_BASE +
                              ((uint32_t)second * STREAM_CHUNK_BYTES)),
         slot_len[second], slot_base[second], first_err);
   }
}

static void stream_print_first16(const uint32_t *slot_base,
                                 const bool *slot_valid)
{
   int first = 0;
   if (slot_valid[1] &&
       (!slot_valid[0] || slot_base[1] < slot_base[0]))
      first = 1;
   if (!slot_valid[first])
      return;
   volatile uint8_t *const p =
      (volatile uint8_t *)(DEF_DDR_BASE +
                           ((uint32_t)first * STREAM_CHUNK_BYTES));
   my_printf("stream_got16 base=%lu bytes="
             "%02x %02x %02x %02x %02x %02x %02x %02x "
             "%02x %02x %02x %02x %02x %02x %02x %02x\r\n",
             (unsigned long)slot_base[first],
             p[0], p[1], p[2], p[3], p[4], p[5], p[6], p[7],
             p[8], p[9], p[10], p[11], p[12], p[13], p[14], p[15]);
}

static uint32_t xor_words(const volatile uint32_t *p, uint32_t words)
{
   uint32_t x = 0U;
   for (uint32_t i = 0U; i < words; i++)
      x ^= p[i];
   return x;
}

static bool stream_direct_crc_eligible(uint32_t quad, uint32_t raw)
{
   return auto_consume && raw != 0U && quad == 0U;
}

static HAL_StatusTypeDef stream_direct_crc_read(uint8_t opcode,
                                                qspi_lines_t dl,
                                                uint8_t dummy,
                                                bool raw,
                                                uint32_t len,
                                                uint32_t *done,
                                                uint32_t *chunks)
{
   *done = 0U;
   *chunks = 0U;
   while (*done < len) {
      const uint32_t n = stream_segment_len(len - *done,
                                            STREAM_CHUNK_BYTES);
      HAL_StatusTypeDef s =
         qspi_mdma_crc_read(opcode, dl, dummy, n, raw,
                            (uint32_t)&CRC1->DR, 60000U);
      if (s != HAL_OK)
         return s;
      *done += n;
      (*chunks)++;
   }
   return HAL_OK;
}

/* -------- command handlers ---------------------------------------- */

static void cmd_help(void)
{
   my_printf(
      "QSPI shell:\r\n"
      " i              JEDEC RDID 0x9F\r\n"
      " f <a> <n>      SFDP read 0x5A\r\n"
      " s [opc=0x05]   opcode-then-1-byte (RDSR)\r\n"
      " ?              status: busy / presc / fsize / csht\r\n"
      " r <a> <n> [op=0x03]   1-lane read\r\n"
      " F <a> <n>      fast read 0x0B\r\n"
      " q <a> <n>      quad-output read 0x6B\r\n"
      " Y <n>          quad one-hot diagnostic read 0x6C @0\r\n"
      " Z <n>          quad byte diagnostic read 0x6D @0\r\n"
      " W <n>          quad nibble-hold diagnostic read 0x6E @0\r\n"
      " U <n>          quad nibble-ramp diagnostic read 0x6F @0\r\n"
      " X <a> <n>      quad-I/O read 0xEB\r\n"
      " 2 <a> <n>      dual-output read 0x3B\r\n"
      " 3 <a> <n>      dual-I/O read 0xBB (alt=0xA0, 4 dummy)\r\n"
      " M <a> <n>      memory-mapped read\r\n"
      " b <n> [q=0/1] [raw=0/1]  bench streaming read\r\n"
      " o <n>          poison DDR MDMA buffer for n bytes\r\n"
      " y [iters=1000] xor timing over 128 KiB DDR\r\n"
      " m <n> [q=0/1] [raw=0/1]  MDMA streaming read into DDR\r\n"
      " a 0|1          auto-consume completed DMA buffers off/on\r\n"
      " N 0|1          idle JEDEC loop off/on\r\n"
      " A <n> [q=0/1] [raw=1] DDR ping-pong MDMA\r\n"
      " j <n> [q=0/1] raw data-only read (no opcode/addr)\r\n"
      " J <b0> ...    raw data-only write (no opcode/addr)\r\n"
      " e [opc=0x06]   opcode-only (WREN)\r\n"
      " v <v> [op=0x01]  write status reg (op + 1B data)\r\n"
      " w <a> <n> [op=0x02]   1-lane page program\r\n"
      " Q <a> <n>      quad-input PP 0x32\r\n"
      " S <a>          sector erase 4 KB (0x20)\r\n"
      " B <a>          block  erase 64 KB (0xD8)\r\n"
      " C              chip erase 0xC7 (confirm)\r\n"
      " P [op] [m] [v] auto-poll status (default WIP=0)\r\n"
      " 4 [0/1]        exit/enter 4-byte addr (0xE9/0xB7)\r\n"
      " R              soft reset 0x66 0x99\r\n"
      " D              deep power-down 0xB9\r\n"
      " d              release DPD 0xAB\r\n"
      " p <n> [s] [dlyb_sel] [unit]  set prescaler/sample/DLYB\r\n"
      " g <mask6>      raw GPIO drive (bits: CLK NCS IO0 IO1 IO2 IO3)\r\n"
      " G              raw GPIO read  (bits: CLK NCS IO0 IO1 IO2 IO3)\r\n"
      " k <n> [q=0/1] [io=1]  bit-bang raw read over GPIO\r\n"
      " K <n>          bit-bang 0x6B quad-output read @0\r\n"
      " t [ms=1]       toggle all 6 pins forever (reset to stop)\r\n"
      " x              abort + drain FIFO\r\n"
      " h              this help\r\n");
}

static void cmd_jedec(void)
{
   const qspi_cmd_t c = {
      .instruction = 0x9FU, .inst_lines = QSPI_LINES_1,
      .data_lines  = QSPI_LINES_1, .data_len = 3U,
   };
   uint8_t id[3] = {0};
   if (qspi_xfer(&c, QSPI_FMODE_READ, id, 100U) != HAL_OK) {
      my_printf("ERR jedec\r\n");
      return;
   }
   my_printf("JEDEC ID: %02x %02x %02x\r\n", id[0], id[1], id[2]);
}

static void cmd_sfdp(int argc, char **argv)
{
   uint32_t addr = arg_u32(argc > 0 ? argv[0] : NULL, 0U);
   uint32_t len  = arg_u32(argc > 1 ? argv[1] : NULL, 16U);
   if (len > READ_CAP) len = READ_CAP;
   const qspi_cmd_t c = {
      .instruction  = 0x5AU,
      .address      = addr,
      .addr_bytes   = 3U,
      .dummy_cycles = 8U,
      .inst_lines   = QSPI_LINES_1,
      .addr_lines   = QSPI_LINES_1,
      .data_lines   = QSPI_LINES_1,
      .data_len     = len,
   };
   if (qspi_xfer(&c, QSPI_FMODE_READ, io_buf, 1000U) != HAL_OK) {
      my_printf("ERR sfdp\r\n");
      return;
   }
   my_printf("SFDP @ 0x%08lx (%lu bytes)\r\n",
             (unsigned long)addr, (unsigned long)len);
   hexdump(addr, io_buf, len);
}

static void cmd_status(int argc, char **argv)
{
   uint32_t opc = arg_u32(argc > 0 ? argv[0] : NULL, 0x05U);
   const qspi_cmd_t c = {
      .instruction = (uint8_t)opc, .inst_lines = QSPI_LINES_1,
      .data_lines  = QSPI_LINES_1, .data_len = 1U,
   };
   uint8_t v = 0xFFU;
   if (qspi_xfer(&c, QSPI_FMODE_READ, &v, 100U) != HAL_OK) {
      my_printf("ERR status\r\n");
      return;
   }
   my_printf("op=%02x -> %02x\r\n", (unsigned)opc, v);
}

static void cmd_query(void)
{
   my_printf("busy=%d presc=%lu fsize=%lu csht=%lu qspi_hz=%lu\r\n",
             qspi_busy(),
             (unsigned long)qspi_get_prescaler(),
             (unsigned long)qspi_get_fsize(),
             (unsigned long)qspi_get_csht(),
             (unsigned long)qspi_kernel_hz());
}

