js216/stm32mp135_test_board/baremetal/qspi/src/cli.c
static void cmd_mm(int argc, char **argv)
{
   uint32_t addr = arg_u32(argc > 0 ? argv[0] : NULL, 0U);
   uint32_t len  = arg_u32(argc > 1 ? argv[1] : NULL, 16U);
   if (len > READ_CAP) len = READ_CAP;
   const qspi_cmd_t c = {
      .instruction   = 0xEBU,
      .addr_bytes    = 3U,
      .alt_bytes     = 0xA0U, .alt_bytes_len = 1U,
      .dummy_cycles  = 4U,
      .inst_lines    = QSPI_LINES_1,
      .addr_lines    = QSPI_LINES_4,
      .alt_lines     = QSPI_LINES_4,
      .data_lines    = QSPI_LINES_4,
   };
   if (qspi_mm_enable(&c) != HAL_OK) {
      my_printf("ERR mm\r\n");
      return;
   }
   const volatile uint8_t *src =
       (const volatile uint8_t *)(QSPI_MM_BASE + addr);
   for (uint32_t i = 0; i < len; i++)
      io_buf[i] = src[i];
   qspi_mm_disable();
   my_printf("MM read %lu @ 0x%08lx\r\n",
             (unsigned long)len, (unsigned long)addr);
   hexdump(addr, io_buf, len);
}

static void cmd_bench(int argc, char **argv)
{
   uint32_t len  = arg_u32(argc > 0 ? argv[0] : NULL, 256U);
   uint32_t quad = arg_u32(argc > 1 ? argv[1] : NULL, 0U);
   uint32_t raw  = arg_u32(argc > 2 ? argv[2] : NULL, 0U);
   if (len == 0U) len = 256U;
   busy_flag = true;

   const uint8_t  opcode = quad ? 0x6BU : 0x0BU;
   const qspi_lines_t dl = quad ? QSPI_LINES_4 : QSPI_LINES_1;
   const uint8_t dummy   = raw ? 0U : 8U;

   uint32_t crc = 0, firsterr = 0, dt = 0;
   uint8_t  got16[16] = {0};
   my_printf("BENCHDBG cmd_pre t=%lu len=%lu quad=%lu opcode=%02x "
             "presc=%lu\r\n",
             (unsigned long)HAL_GetTick(), (unsigned long)len,
             (unsigned long)quad, (unsigned)opcode,
             (unsigned long)qspi_get_prescaler());
   HAL_StatusTypeDef s = qspi_bench_read(opcode, dl, dummy, len,
                                         raw != 0U,
                                         &crc, &firsterr, got16, &dt);
   my_printf("BENCHDBG cmd_post t=%lu rc=%d dt=%lu firsterr=%ld\r\n",
             (unsigned long)HAL_GetTick(), (int)s, (unsigned long)dt,
             (firsterr == 0xFFFFFFFFU) ? -1L : (long)firsterr);
   if (s != HAL_OK) {
      my_printf("ERR bench (%d)\r\n", (int)s);
      busy_flag = false;
      return;
   }
   if (dt == 0U) dt = 1U;
   /* Mbps in tenths: rate (Mbits/s * 10) = len * 8 * 10 / (dt * 1000)
    *               = len / (dt * 12.5)   ~=  len * 80 / (dt * 1000).
    * Guard the multiplication against 32-bit overflow for len up to 50 MB. */
   uint32_t mbps_x10;
   if (len <= 50000000U)
      mbps_x10 = (len * 80U) / (dt * 1000U);
   else
      mbps_x10 = ((len / 1000U) * 80U) / dt;
   const long firsterr_signed =
       (firsterr == 0xFFFFFFFFU) ? -1L : (long)firsterr;
   my_printf("bench %lu B %s @ presc=%lu in %lu ms, %lu.%lu Mbps, "
             "crc32=%08lx, expect=%08lx, firsterr=%ld, "
             "got=%02x %02x %02x %02x "
             "%02x %02x %02x %02x %02x %02x %02x %02x "
             "%02x %02x %02x %02x\r\n",
             (unsigned long)len,
             quad ? "quad" : "1lane",
             (unsigned long)qspi_get_prescaler(),
             (unsigned long)dt,
             (unsigned long)(mbps_x10 / 10U),
             (unsigned long)(mbps_x10 % 10U),
             (unsigned long)crc,
             (unsigned long)crc32_expected(len),
             firsterr_signed,
             got16[0], got16[1], got16[2], got16[3],
             got16[4], got16[5], got16[6], got16[7],
             got16[8], got16[9], got16[10], got16[11],
             got16[12], got16[13], got16[14], got16[15]);
   busy_flag = false;
}

/* MDMA streaming read into DDR.  Validates the same i&0xFF incrementing
 * pattern the bench expects and prints throughput + CRC32 + first-error
 * offset.  Destination is `DEF_DDR_BASE` (0xC0000000) -- 16 MB+ workloads
 * are expected to exceed SRAM and must use this path. */
static void cmd_mdma(int argc, char **argv)
{
   uint32_t len  = arg_u32(argc > 0 ? argv[0] : NULL, 4096U);
   uint32_t quad = arg_u32(argc > 1 ? argv[1] : NULL, 0U);
   uint32_t raw  = arg_u32(argc > 2 ? argv[2] : NULL, 0U);
   if (len == 0U) len = 4096U;
   /* MDMA path requires 4-byte alignment. Large decimal transfers are
    * split into 64 KB-multiple chunks plus a final aligned tail. */
   if (len & 0x3U) {
      my_printf("ERR mdma: len must be 4-byte aligned\r\n");
      return;
   }
   busy_flag = true;

   const uint8_t  opcode = quad ? 0x6BU : 0x0BU;
   const qspi_lines_t dl = quad ? QSPI_LINES_4 : QSPI_LINES_1;
   const uint8_t dummy   = raw ? 0U : 8U;
   const uint32_t dst    = DEF_DDR_BASE;
   volatile uint8_t *const p = (volatile uint8_t *)dst;
   const uint32_t poison_ms = 0U;

   my_printf("mdma_begin %lu B %s\r\n",
             (unsigned long)len,
             quad ? "quad" : "1lane");
   const uint32_t t0 = HAL_GetTick();
   uint32_t done = 0U;
   HAL_StatusTypeDef s = HAL_OK;
   while (done < len) {
      uint32_t n = mdma_segment_len(len - done, 1048576U);
      s = qspi_mdma_read(opcode, dl, dummy, n, raw != 0U, dst + done,
                         60000U, true);
      if (s != HAL_OK)
         break;
      done += n;
   }
   const uint32_t xfer_ms = HAL_GetTick() - t0;
   if (s != HAL_OK) {
      my_printf("ERR mdma (%d) done=%lu dt=%lu\r\n",
                (int)s, (unsigned long)done, (unsigned long)xfer_ms);
      busy_flag = false;
      return;
   }
   uint32_t xfer_dt = xfer_ms;
   if (xfer_dt == 0U) xfer_dt = 1U;
   uint32_t xfer_mbps_x10;
   if (len <= 50000000U)
      xfer_mbps_x10 = (len * 80U) / (xfer_dt * 1000U);
   else
      xfer_mbps_x10 = ((len / 1000U) * 80U) / xfer_dt;
   my_printf("mdma_xfer %lu B %s in %lu ms, %lu.%lu Mbps\r\n",
             (unsigned long)len,
             quad ? "quad" : "1lane",
             (unsigned long)xfer_ms,
             (unsigned long)(xfer_mbps_x10 / 10U),
             (unsigned long)(xfer_mbps_x10 % 10U));

   /* CRC32 + first-error scan over the DDR buffer. */
   const uint32_t validate_t0 = HAL_GetTick();
   uint32_t crc       = 0xFFFFFFFFUL;
   uint32_t first_err = 0xFFFFFFFFUL;
   for (uint32_t i = 0; i < len; i++) {
      const uint8_t b = p[i];
      crc ^= (uint32_t)b;
      for (int j = 0; j < 8; j++)
         crc = (crc >> 1) ^ (0xEDB88320UL & (-(int32_t)(crc & 1U)));
      const uint8_t exp = (uint8_t)(i & 0xFFU);
      if (b != exp && first_err == 0xFFFFFFFFUL)
         first_err = i;
   }
   crc ^= 0xFFFFFFFFUL;
   const uint32_t validate_ms = HAL_GetTick() - validate_t0;

