js216/stm32mp135_test_board/baremetal/qspi/src/cli.c
   uint32_t dt = xfer_ms;
   if (dt == 0U) dt = 1U;
   uint32_t mbps_x10;
   if (len <= 50000000U)
      mbps_x10 = (len * 80U) / (dt * 1000U);
   else
      mbps_x10 = ((len / 1000U) * 80U) / dt;

   const long firsterr_signed =
       (first_err == 0xFFFFFFFFU) ? -1L : (long)first_err;
   my_printf("mdma %lu B %s in %lu ms, %lu.%lu Mbps, "
             "crc32=%08lx, expect=%08lx, firsterr=%ld, "
             "xfer=%lu ms, validate=%lu ms, "
             "poison=%lu ms, auto=%s\r\n",
             (unsigned long)len,
             quad ? "quad" : "1lane",
             (unsigned long)dt,
             (unsigned long)(mbps_x10 / 10U),
             (unsigned long)(mbps_x10 % 10U),
             (unsigned long)crc,
             (unsigned long)crc32_expected(len),
             firsterr_signed,
             (unsigned long)xfer_ms,
             (unsigned long)validate_ms,
             (unsigned long)poison_ms,
             auto_consume ? "on" : "off");
   busy_flag = false;
}

static void cmd_poison(int argc, char **argv)
{
   uint32_t len = arg_u32(argc > 0 ? argv[0] : NULL, 4096U);
   if (len == 0U)
      len = 4096U;
   if (len & 0x3U) {
      my_printf("ERR poison: len must be 4-byte aligned\r\n");
      return;
   }
   busy_flag = true;
   volatile uint8_t *const p = (volatile uint8_t *)DEF_DDR_BASE;
   const uint32_t t0 = HAL_GetTick();
   for (uint32_t i = 0; i < len; i++)
      p[i] = (uint8_t)(~i & 0xFFU);
   __asm volatile("dsb sy" ::: "memory");
   const uint32_t dt = HAL_GetTick() - t0;
   my_printf("poison %lu B in %lu ms\r\n",
             (unsigned long)len, (unsigned long)dt);
   busy_flag = false;
}

static void cmd_xor_time(int argc, char **argv)
{
   uint32_t iters = arg_u32(argc > 0 ? argv[0] : NULL, 1000U);
   if (iters == 0U)
      iters = 1U;

   volatile uint32_t *const p = (volatile uint32_t *)DEF_DDR_BASE;
   const uint32_t words = STREAM_XOR_BYTES / sizeof(uint32_t);
   uint32_t x = 0U;

   busy_flag = true;
   for (uint32_t i = 0U; i < words; i++)
      p[i] = pattern_word(i * 4U);
   __asm volatile("dsb sy" ::: "memory");

   uint32_t t0 = HAL_GetTick();
   for (uint32_t i = 0U; i < iters; i++)
      x ^= xor_words(p, words);
   const uint32_t cached_ms = HAL_GetTick() - t0;

   t0 = HAL_GetTick();
   for (uint32_t i = 0U; i < iters; i++) {
      for (uint32_t a = DEF_DDR_BASE;
           a < DEF_DDR_BASE + STREAM_XOR_BYTES; a += 32U)
         L1C_InvalidateDCacheMVA((void *)a);
      __asm volatile("dsb sy" ::: "memory");
      x ^= xor_words(p, words);
   }
   const uint32_t cold_ms = HAL_GetTick() - t0;

   my_printf("xor128 len=%lu iters=%lu xor=%08lx cached=%lu ms "
             "cached_us_x1000=%lu cold=%lu ms cold_us_x1000=%lu\r\n",
             (unsigned long)STREAM_XOR_BYTES,
             (unsigned long)iters,
             (unsigned long)x,
             (unsigned long)cached_ms,
             (unsigned long)((cached_ms * 1000000UL) / iters),
             (unsigned long)cold_ms,
             (unsigned long)((cold_ms * 1000000UL) / iters));
   busy_flag = false;
}

/* DDR ping-pong auto-consume MDMA path.  This keeps the bulk-DDR `m`
 * command intact but gives sustained-stream bring-up a separate command
 * whose validation consumes completed chunks into one running CRC. */
static void cmd_auto_stream(int argc, char **argv)
{
   uint32_t len   = arg_u32(argc > 0 ? argv[0] : NULL, 4096U);
   uint32_t quad  = arg_u32(argc > 1 ? argv[1] : NULL, 0U);
   uint32_t raw   = arg_u32(argc > 2 ? argv[2] : NULL, 1U);
   uint32_t chunk = auto_consume ? STREAM_CHUNK_BYTES :
                                  STREAM_MAX_XFER_BYTES;
   if (len == 0U)
      len = 4096U;
   if (len & 0x3U) {
      my_printf("ERR stream: len must be 4-byte aligned\r\n");
      return;
   }
   busy_flag = true;

   const uint8_t  opcode = quad ? 0x6BU : 0x0BU;
   const qspi_lines_t dl = quad ? QSPI_LINES_4 : QSPI_LINES_1;
   const uint8_t dummy   = raw ? 0U : 8U;

   uint32_t first_err = 0xFFFFFFFFUL;
   uint32_t done      = 0U;
   uint32_t started   = 0U;
   uint32_t chunks    = 0U;
   uint32_t crc       = CRC32_INIT;
   bool hw_crc        = false;
   uint32_t slot_base[2] = {0U, 0U};
   uint32_t slot_len[2]  = {0U, 0U};
   bool slot_valid[2]    = {false, false};
   const uint32_t t0  = HAL_GetTick();
   uint32_t xfer_ms   = 0U;
   bool xfer_reported = false;
   bool crc_dma_error = false;
   bool direct_crc    = false;
   const char *buf_name = "ddr";
   HAL_StatusTypeDef s = HAL_OK;

   if (stream_direct_crc_eligible(quad, raw) && crc32_hw_begin_direct()) {
      direct_crc = true;
      hw_crc = true;
      buf_name = "crc";
      s = stream_direct_crc_read(opcode, dl, dummy, raw != 0U, len,
                                 &done, &chunks);
      started = done;
   } else if (auto_consume) {
      hw_crc = crc32_hw_begin();

      uint32_t active_idx = 0U;
      uint32_t active_base = 0U;
      uint32_t active_len = stream_segment_len(len, STREAM_CHUNK_BYTES);
      int crc_active_idx = -1;

      s = qspi_mdma_start(opcode, dl, dummy, active_len, raw != 0U,
                          DEF_DDR_BASE, 60000U, false);
      if (s == HAL_OK)
         started = active_len;

      while (s == HAL_OK && done < len) {
         s = qspi_mdma_finish_no_inval(60000U);
         if (s != HAL_OK)
            break;

         uint32_t next_idx = active_idx ^ 1U;
         uint32_t next_base = started;
         uint32_t next_len = 0U;
         bool next_active = false;

         if (started < len) {
            if (hw_crc && crc_active_idx == (int)next_idx) {
               s = crc32_mdma_wait(CRC_MDMA_TIMEOUT_MS);
               if (s != HAL_OK) {
                  crc_dma_error = true;
                  break;
               }
               crc_active_idx = -1;
            }
            next_len = stream_segment_len(len - started,
                                          STREAM_CHUNK_BYTES);
            s = qspi_mdma_start(opcode, dl, dummy, next_len,
                                raw != 0U,
                                DEF_DDR_BASE +
                                   (next_idx * STREAM_CHUNK_BYTES),
                                60000U, false);
            if (s != HAL_OK)
               break;
            started += next_len;
            next_active = true;
         }

         if (!next_active) {
            xfer_ms = HAL_GetTick() - t0;
            stream_print_xfer(len, quad != 0U, xfer_ms);
            xfer_reported = true;
         }

         volatile uint8_t *const p =
            (volatile uint8_t *)(DEF_DDR_BASE +
                                 (active_idx * STREAM_CHUNK_BYTES));
         qspi_invalidate_range((uint32_t)p, active_len);
         if (hw_crc) {
            if (crc_active_idx >= 0) {
               s = crc32_mdma_wait(CRC_MDMA_TIMEOUT_MS);
               if (s != HAL_OK) {
                  crc_dma_error = true;
                  break;
               }
               crc_active_idx = -1;
            }
            s = crc32_mdma_start(p, active_len);
            if (s != HAL_OK) {
               crc_dma_error = true;
               break;
            }
            crc_active_idx = (int)active_idx;
         } else {
            crc = crc32_update_buf(crc, p, active_len, active_base, NULL);
         }
         slot_base[active_idx] = active_base;
         slot_len[active_idx] = active_len;
         slot_valid[active_idx] = true;
         done += active_len;
         chunks++;

         if (!next_active)
            break;
         active_idx = next_idx;
         active_base = next_base;
         active_len = next_len;
      }
      if (s == HAL_OK && hw_crc && crc_active_idx >= 0) {
         s = crc32_mdma_wait(CRC_MDMA_TIMEOUT_MS);
         if (s != HAL_OK)
            crc_dma_error = true;
         crc_active_idx = -1;
      }
   } else {
      while (done < len) {
         uint32_t n = stream_segment_len(len - done, chunk);
         s = qspi_mdma_start(opcode, dl, dummy, n, raw != 0U,
                             DEF_DDR_BASE + done, 60000U, false);
         if (s == HAL_OK)
            s = qspi_mdma_finish_no_inval(60000U);
         if (s != HAL_OK)
            break;
         done += n;
         started += n;
         chunks++;
      }
   }
   if (!xfer_reported) {
      xfer_ms = HAL_GetTick() - t0;
   }
   if (s != HAL_OK) {
      if (crc32_mdma_active)
         (void)crc32_mdma_wait(CRC_MDMA_TIMEOUT_MS);
      my_printf("ERR stream %s (%d) done=%lu dt=%lu\r\n",
                crc_dma_error ? "crc" : "xfer",
                (int)s, (unsigned long)done, (unsigned long)xfer_ms);
      busy_flag = false;
      return;
   }
   if (!xfer_reported)
      stream_print_xfer(len, quad != 0U, xfer_ms);

   const uint32_t dt_raw = HAL_GetTick() - t0;
   uint32_t dt = xfer_ms;
   if (dt == 0U)
      dt = 1U;
   uint32_t mbps_x10 = stream_mbps_x10(len, dt, quad ? 4U : 1U);

